var city_borders = {
	'北京': ['天津',/*'秦皇岛'*/],
	'天津': ['北京',/*'秦皇岛'*/],
	'秦皇岛': ['北京','天津'],
	
	'沈阳': ['大连','长春','吉林'],
	'大连': ['沈阳'],
	'长春': ['沈阳','哈尔滨','吉林'],
	'吉林': ['沈阳','长春','哈尔滨','牡丹江'],
	'牡丹江': ['哈尔滨','吉林'],
	'哈尔滨': ['长春','牡丹江','吉林'],
	
	'上海': ['南京','杭州','宁波','无锡','扬州','温州'],
	'南京': ['上海'],
	'杭州': ['上海','宁波','温州','南京','无锡'],
	'宁波': ['上海','温州','杭州'],
	'无锡': ['上海','南京','杭州'],
	'温州': ['宁波'],
	
	'厦门': [],
	'济南': ['青岛'],
	'青岛': ['济南','烟台'],
	'烟台': ['青岛'],
	
	'郑州': [],
	'武汉': ['南京','郑州'],
	'长沙': ['武汉'],
	
	'广州': ['深圳'],
	'深圳': ['广州'],
	'海口': ['三亚'],
	'三亚': ['海口'],
	
	'重庆': ['成都'],
	'成都': ['重庆'],
	'昆明': [],
	'西安': [],
	'兰州': ['西宁'],
	'西宁': ['兰州'],
	'银川': [],
	'乌鲁木齐': []

}
